OdDbBaseBlockPE.getName(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the name of block.
\param pBlock [in] A pointer to a block.

OdDbBaseBlockPE.isAnonymous(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns true if and only if block is an anonymous block.
\param pBlock [in] A pointer to a block.

OdDbBaseBlockPE.getLayoutId(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns a specified block's layout identifier.
\param pBlock [in] A pointer to a block.

OdDbBaseBlockPE.xrefDatabase(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns a referenced database for a specified block.
\param pBlock [in] A pointer to a block.

OdDbBaseBlockPE.isFromExternalReference(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Determines whether a specified block is an external reference.
\param pBlock [in] A pointer to a block.
\returns Returns true if the block is an external reference, otherwise returns false.

OdDbBaseBlockPE.isBlockReferenceAdded(OdRxObject*)
\details
Determines whether a block reference has been added to a specified block.
\param pBlock [in] A pointer to a block.
\returns Returns true if a block reference has been added, otherwise returns false.